export default {
  name: "قائمة",
  author: "سينكو 𓆩☆𓆪",
  cooldowns: 5,
  description: "قائمة الأوامر",
  role: "member",
  aliases: ["menu", "قائمه", "اوامر", "المنيو", "الاوامر"],
  execute: async ({ api, event }) => {
    const prefix = global.client?.config?.prefix || "*";
    const totalCommands = global.client?.commands?.size || 80;

    const msg = `✧══════•❁◈❁•══════✧
✺ ┇
✺ ┇ ⏣ ⟬ قـسـم الـمـجـمـوعـة ⟭
✺ ┇ ◍ اوامر ◍ ادارة ◍ ارفع
✺ ┇ ◍ بادئة ◍ مجموعتي ◍ حذف
✺ ┇ ◍ طرد ◍ صورة ◍ مسح
✺ ┇ ◍ اسم ◍ لاست
✺ ┇ ⸻⸻⸻⸻⸻
✺ ┇
✺ ┇ ⏣ ⟬ قـسـم الـوسـائـط ⟭
✺ ┇ ◍ اغـنـيـة ◍ صـور ◍ رابط
✺ ┇ ◍ تيـك تـوك ◍ ميكو
✺ ┇ ⸻⸻⸻⸻⸻
✺ ┇
✺ ┇ ⏣ ⟬ قـسـم الـذكـاء ⟭
✺ ┇ ◍ ارت ◍ ازالة ◍ انـمـي
✺ ┇ ◍ ذكـاء ◍ بنتراست ◍ تعـالي
✺ ┇ ◍ مقطع ◍ إعجاب ◍ كراش
✺ ┇ ◍ ميدجورني ◍ ماجيك ◍ برومبت
✺ ┇ ⸻⸻⸻⸻⸻
✺ ┇
✺ ┇ ⏣ ⟬ قـسـم الـتـرفـيـه ⟭
✺ ┇ ◍ بروفايل ◍ تحدي ◍ زوجيني
✺ ┇ ◍ بوسة ◍ دمج ◍ صفع
✺ ┇ ◍ قبر ◍ مرحاض ◍ اعلام
✺ ┇ ◍ اخترق ◍ معلوماتي ◍ أزياء
✺ ┇ ◍ اقتباس ◍ صبح ◍ غموض
✺ ┇ ◍ نيزكو ◍ ليل ◍ ونبيس
✺ ┇ ◍ تذكير ◍ شاذ ◍ مثير
✺ ┇ ◍ سيجما ◍ ماذ-لو ◍ اكس_او
✺ ┇ ◍ قبح ◍ حضن2 ◍ بائع
✺ ┇ ⸻⸻⸻⸻⸻
✺ ┇
✺ ┇ ⏣ ⟬ قـسـم الاقـتـصـاد ⟭
✺ ┇ ◍ بنك ◍ رصيدي ◍ يومي
✺ ┇ ◍ صرف ◍ نقاط ◍ توب
✺ ┇ ⸻⸻⸻⸻⸻
✺ ┇
✺ ┇ ⏣ ⟬ قـسـم الـمـطـوࢪ ⟭
✺ ┇ ◍ إشعار ◍ تجربة ◍ غادري
✺ ┇ ◍ المطور ◍ موافقة ◍ طلبات
✺ ┇ ◍ رست ◍ المستخدم ◍ بايو
✺ ┇ ◍ اوبتايم ◍ مسح ◍ الرمز
✺ ┇ ⸻⸻⸻⸻⸻
✺ ┇
✺ ┇ ⠇الـبـادئـة: ${prefix}
✺ ┇ ⠇عـدد الأوامـر: ${totalCommands}
✺ ┇ ⠇الـمـطـوࢪ: سـيـنـكـو 𓆩☆𓆪
✺ ┇
✧══════•❁◈❁•══════✧`;

    api.sendMessage(msg, event.threadID, event.messageID);
  },
};
